Revit 2027 API
LegendFailures Properties
The BuiltInFailures.LegendFailures type exposes the following members.
Properties
Name | Description
LegendComponentBadViewType |  Legend Components may only be placed in Legends
LegendComponentNotVisible |  The component you have selected is not visible in the selected view.
Top
See Also
Reference
BuiltInFailures.LegendFailures Class
Autodesk.Revit.DB Namespace